maven/OpenIDM-provisioning/OpenIDM-provisioning-service/src/test/resources/requests/modifyRequest01.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:prov="http://openidm.forgerock.com/xml/ns/public/provisioning/provisioning-1.wsdl"
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
   xmlns:com='http://openidm.forgerock.com/xml/ns/public/common/common-1.xsd'
   xmlns:r='http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd'
   xmlns:ics="http://openidm.forgerock.com/xml/ns/public/resource/idconnector/resource-schema-1.xsd"
   xmlns:icc="http://openidm.forgerock.com/xml/ns/public/resource/idconnector/configuration-1.xsd"
   xmlns:iccldap="http://openidm.forgerock.com/xml/ns/resource/idconnector/bundle/org.identityconnectors.ldap/org.identityconnectors.ldap.LdapConnector/1.0.5531"
   xmlns:dj="http://openidm.forgerock.com/xml/ns/public/resource/instances/ef2bc95b-76e0-48e2-86d6-3d4f02d3e1a2"
   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xsi:schemaLocation='http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/
   http://www.w3.org/2001/XMLSchema http://www.w3.org/2001/XMLSchema
   http://openidm.forgerock.com/xml/ns/public/common/common-1.xsd ../../../../../../OpenIDM-xml/OpenIDM-schemas/src/main/resources/META-INF/wsdl/xml/ns/public/common/common-1.xsd
   http://openidm.forgerock.com/xml/ns/public/resource/idconnector/resource-schema-1.xsd ../../../../../../OpenIDM-xml/OpenIDM-schemas/src/main/resources/META-INF/wsdl/xml/ns/public/resource/idconnector/resource-schema-1.xsd
   http://openidm.forgerock.com/xml/ns/public/resource/idconnector/configuration-1.xsd ../../../../../../OpenIDM-xml/OpenIDM-schemas/src/main/resources/META-INF/wsdl/xml/ns/public/resource/idconnector/configuration-1.xsd'>
    <soapenv:Header/>
    <soapenv:Body>
        <prov:modifyObject>
            <objectChange>
                <com:oid>ef2bc95b-13e0-48e2-86d6-3d4f02d3e13d</com:oid>
                <!--1 or more repetitions:-->
                <com:change path="/givenName" changeType="add">
                    <dj:givenName xmlns:dj="http://openidm.forgerock.com/xml/ns/public/resource/instances/ef2bc95b-76e0-48e2-86d6-3d4f02d3e1a2">John</dj:givenName>
                </com:change>
                <com:change path="/groups" changeType="replace">
                    <dj:groups xmlns:dj="http://openidm.forgerock.com/xml/ns/public/resource/instances/ef2bc95b-76e0-48e2-86d6-3d4f02d3e1a2">cn=Pirates,ou=Groups,dc=example,dc=com</dj:groups>
                    <dj:groups xmlns:dj="http://openidm.forgerock.com/xml/ns/public/resource/instances/ef2bc95b-76e0-48e2-86d6-3d4f02d3e1a2">cn=Users,ou=Groups,dc=example,dc=com</dj:groups>
                </com:change>
                <com:change path="/fullName" changeType="replace">
                    <dj:fullName xmlns:dj="http://openidm.forgerock.com/xml/ns/public/resource/instances/ef2bc95b-76e0-48e2-86d6-3d4f02d3e1a2">John Doe</dj:fullName>
                </com:change>
                <com:change path="/custom[@oid='1234']/attributes" changeType="delete"/>
            </objectChange>
            <result oid="?" type="?">
                <com:extension>
               <!--You may enter ANY elements at this point-->
                </com:extension>
                <!--Zero or more repetitions:-->
                <result oid="?" type="?">
                    <com:extension>
                    <!--You may enter ANY elements at this point-->
                    </com:extension>
                </result>
            </result>
        </prov:modifyObject>
    </soapenv:Body>
</soapenv:Envelope>